We're going to try to use this package to simulate the migration of an
environment. A full migration should have these steps:

1. Initial material setup and verification
2. Pre-migration sync
3. Soft-switch
4. Clean-halt
5. New sequencer
6. Full switch over


This test is just a simulation, so we'll skip the pre-migration sync
where we would get a clean copy of the state db, bridge db, and DAC
db.

- Rollup https://sepolia.etherscan.io/address/0x358F5433Bd221E1647C40C360fc206A6d6a00A44
- Rollup Manager https://sepolia.etherscan.io/address/0xa05884c86C76739c66945d7E66eb2fB13E621255


The current sequencer is ~0x3C3Ade761F53bdf4F3f40B46D0AbDA286C2aCDcC~
and the current admin is ~0x66415f84060F1E29249854B3adD1005c13B179e8~.

* DAC Setup

Alright, our rollup has a new admin now. We'll also need to transfer
ownership of the dac.

#+begin_src bash :exports both verbatim :results output code
old_admin_pkey="0x0a32ff2b564f2aaef2edbccc0b17dd5e8b7c4095fb401656628e9d152c905436"
new_admin_addr="0xd03C837B1C09Dc463E3dC7Efc337E38Fb01fC158"
cast send --rpc-url https://eth-sepolia.public.blastapi.io --private-key $old_admin_pkey 0xEe4B418D20A13113eBeD4842b42C1412F31C1DD5 'transferOwnership(address)' $new_admin_addr
#+end_src

#+RESULTS:
#+begin_src bash

blockHash               0x62ee47eecbfa43e2493e6e4c47ecda8059dd1d6e27fc23fd3680af73919af807
blockNumber             6127029
contractAddress
cumulativeGasUsed       4575972
effectiveGasPrice       7167671856
from                    0x66415f84060F1E29249854B3adD1005c13B179e8
gasUsed                 35690
logs                    [{"address":"0xee4b418d20a13113ebed4842b42c1412f31c1dd5","topics":["0x8be0079c531659141344cd1fd0a4f28419497f9722a3daafe3b4186f6b6457e0","0x00000000000000000000000066415f84060f1e29249854b3add1005c13b179e8","0x000000000000000000000000d03c837b1c09dc463e3dc7efc337e38fb01fc158"],"data":"0x","blockHash":"0x62ee47eecbfa43e2493e6e4c47ecda8059dd1d6e27fc23fd3680af73919af807","blockNumber":"0x5d7db5","transactionHash":"0x2b1434c41ab00fb52a0909597450b46a29c32bbc1566eef48572555ad7d0c225","transactionIndex":"0x9","logIndex":"0x4","removed":false}]
logsBloom               0x00000000000000000000000000000000000000000000000000800004000000000000000000000000000000000000000200000000400000000000000000000000000000000000000000400000000000000001000000000000000000000000000000000000000000004000000000000000000000000000000000000000000000400000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001000000000000004000000000008000000000000000000000000000000000000000000400000000000000000000
root
status                  1
transactionHash         0x2b1434c41ab00fb52a0909597450b46a29c32bbc1566eef48572555ad7d0c225
transactionIndex        9
type                    2
to                      0xEe4B418D20A13113eBeD4842b42C1412F31C1DD5
#+end_src


Now we should see if we can rotate a key for the DAC. In production it
might be safer to add a few additional nodes rather than trying a
migration like this.

Let's create a new key for our DAC member:

#+begin_src bash :exports both verbatim :results output code
cast wallet new
#+end_src

#+RESULTS:
#+begin_src bash
Successfully created new keypair.
Address:     0x5018895310B962aC12b837FAD66e177aC7863Ca5
Private key: 0x941c1830f5dcb7439c2c6387840664bbe306323eee24f6000a30ab91ac782a58
#+end_src

Let's update this value on chain

#+begin_src bash :exports both verbatim :results output code
new_admin_pkey="0x582fb4c16b0acd6c084d939ef1195a71205bd67621cd3ab78fd411c72938086f"
dac_addr="0xEe4B418D20A13113eBeD4842b42C1412F31C1DD5"
cast send \
    --private-key "$new_admin_pkey" \
    --rpc-url "https://eth-sepolia.public.blastapi.io" \
    "$dac_addr" \
    'function setupCommittee(uint256 _requiredAmountOfSignatures, string[] urls, bytes addrsBytes) returns()' \
    1 ["http://zkevm-dac-001:8484"] 0x5018895310B962aC12b837FAD66e177aC7863Ca5
#+end_src

#+RESULTS:
#+begin_src bash

blockHash               0x44d3b075507b532bac0a34d13bbdafd0fb38b7a10ba243c1e56424260f7340e7
blockNumber             6127152
contractAddress
cumulativeGasUsed       437741
effectiveGasPrice       5971707627
from                    0xd03C837B1C09Dc463E3dC7Efc337E38Fb01fC158
gasUsed                 53690
logs                    [{"address":"0xee4b418d20a13113ebed4842b42c1412f31c1dd5","topics":["0x831403fd381b3e6ac875d912ec2eee0e0203d0d29f7b3e0c96fc8f582d6db657"],"data":"0xc89c320a62c522717b4d8a55699989e1d681af9afc3f66503c0c34ac9bf91cb0","blockHash":"0x44d3b075507b532bac0a34d13bbdafd0fb38b7a10ba243c1e56424260f7340e7","blockNumber":"0x5d7e30","transactionHash":"0x0fe3ca4db862dbfb7599c8a24800066bcbaca41d14cf95e728f2b2e1fb4079e3","transactionIndex":"0xc","logIndex":"0x4","removed":false}]
logsBloom               0x00000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000004000000000000000000000000000000000000000000000000000000000000000000000020000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002000000000001000000000000000000000000000000000000000000000000000000000000000000000400000000000000000001
root
status                  1
transactionHash         0x0fe3ca4db862dbfb7599c8a24800066bcbaca41d14cf95e728f2b2e1fb4079e3
transactionIndex        12
type                    2
to                      0xEe4B418D20A13113eBeD4842b42C1412F31C1DD5
#+end_src


Okay there should be a new DAC key for onchain
verification. Unfortunately, the application requires a keystore, so
we'll need to wrangle private key into a keystore file.

#+begin_src bash :exports both verbatim :results output code
polycli parseethwallet --hexkey "0x941c1830f5dcb7439c2c6387840664bbe306323eee24f6000a30ab91ac782a58" --password "pSnv6Dh5s9ahuzGzH9RoCDrKAMddaX3m" --keystore /tmp/dac
cat /tmp/dac/UTC* | jq '.' | tee dac-new.keystore
#+end_src

#+RESULTS:
#+begin_src bash
{
  "address": "5018895310b962ac12b837fad66e177ac7863ca5",
  "crypto": {
    "cipher": "aes-128-ctr",
    "ciphertext": "994f3b65263a85b2cdc6d246d868dbc82dba4633b8b813689b06f981374bd1df",
    "cipherparams": {
      "iv": "14c034e7254c1f2338009ce201d54942"
    },
    "kdf": "scrypt",
    "kdfparams": {
      "dklen": 32,
      "n": 262144,
      "p": 1,
      "r": 8,
      "salt": "e66f05a9ac1f372515c93d761d4da29bf3ccdb7e026ea7321397461dc463c127"
    },
    "mac": "43c0594597e61e06e3dd4c081b3c525a4225de702ed2021ca459862e7bf2d7bd"
  },
  "id": "71e11b91-7aa9-483b-95f0-7cc18a349b59",
  "version": 3
}
#+end_src

We now have a new file that we can use as the keystore for our
dac. We're going to copy this file into the image and restart it. If I
run ~kurtosis enclave inspect cdk-v1 --full-uuids~ I'll be able to get
the UUID for the ~zkevm-dac-001~ and then write a copy command to
replace the current keystore.

#+begin_src bash
docker cp dac-new.keystore zkevm-dac-001--d098ab1fe97e40b1a0c2a77331466c38:/etc/zkevm/dac.keystore
kurtosis service stop cdk-v1 zkevm-dac-001
kurtosis service start cdk-v1 zkevm-dac-001
#+end_src

#+RESULTS:
| [36mINFO[0m[2024-06-17T09:38:42-04:00] | Stopping | service | 'zkevm-dac-001' |
| [36mINFO[0m[2024-06-17T09:38:45-04:00] | Starting | service | 'zkevm-dac-001' |

I can see these logs in the sequence sender

#+begin_example
[zkevm-node-sequence-sender-001] {"level":"info","ts":1718632391.4257238,"caller":"datacommittee/datacommittee.go:210","msg":"sending request to sign the sequence to 0x5018895310B962aC12b837FAD66e177aC7863Ca5 at http://zkevm-dac-001:8484","pid":6,"version":"0.6.5+cdk"}
[zkevm-node-sequence-sender-001] {"level":"info","ts":1718632391.4280317,"caller":"datacommittee/datacommittee.go:195","msg":"received signature from 0x5018895310B962aC12b837FAD66e177aC7863Ca5","pid":6,"version":"0.6.5+cdk"}
#+end_example

I think that's a good thing since that's the address for our new DAC
member. Now we can see that a sequenced with signatures from the new
DAC key:
https://sepolia.etherscan.io/tx/0x8d32aa5da27bf41ffeb59cd42369d6c1266dbca357e29411e6c8d01cc088d115

